NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/compressible/acousticFoam/obliqueAirJet/precursor/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 -1 20);
    }

    "(window|fixedWall)"
    {
        type            noSlip;
    }

    box
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
}


// ************************************************************************* //
